/*
 * Simple example of use of vm86: launch a basic .com DOS executable
 */
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include <unistd.h>
#include <fcntl.h>
#include <time.h>
#include <sys/mman.h>
#include <sys/ioctl.h>
#include <sys/time.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/statfs.h>
#include <signal.h>
#include <errno.h>
#include <ctype.h>
#include <termios.h>
#include <dirent.h>
#include <fnmatch.h>

#include <sys/syscall.h>
#include <asm/vm86.h>

//#define DUMP_INT21

static inline int vm86(int func, struct vm86plus_struct *v86)
{
    return syscall(__NR_vm86, func, v86);
}

#define CF_MASK 		0x00000001
#define ZF_MASK 		0x00000040
#define TF_MASK 		0x00000100
#define IF_MASK 		0x00000200
#define DF_MASK 		0x00000400
#define IOPL_MASK		0x00003000
#define NT_MASK	         	0x00004000
#define RF_MASK			0x00010000
#define VM_MASK			0x00020000
#define AC_MASK			0x00040000
#define VIF_MASK                0x00080000
#define VIP_MASK                0x00100000
#define ID_MASK                 0x00200000

void usage(void)
{
    printf("runcom version 0.2-slitaz (c) 2003-2011 Fabrice Bellard\n"
           "usage: runcom file.com [args...]\n"
           "Run simple .com DOS executables (linux vm86 test mode)\n");
    exit(1);
}

static inline void set_bit(uint8_t *a, unsigned int bit)
{
    a[bit / 8] |= (1 << (bit % 8));
}

static inline uint8_t *seg_to_linear(unsigned int seg, unsigned int reg)
{
    return (uint8_t *)((seg << 4) + (reg & 0xffff));
}

static inline void pushw(struct vm86_regs *r, int val)
{
    r->esp = (r->esp & ~0xffff) | ((r->esp - 2) & 0xffff);
    *(uint16_t *)seg_to_linear(r->ss, r->esp) = val;
}

void dump_regs(struct vm86_regs *r)
{
    int i;
    uint8_t *p8;
    uint16_t *p16;
    fprintf(stderr,
            "EAX=%08lx EBX=%08lx ECX=%08lx EDX=%08lx\n"
            "ESI=%08lx EDI=%08lx EBP=%08lx ESP=%08lx\n"
            "EIP=%08lx EFL=%08lx "
            "CS=%04x DS=%04x ES=%04x SS=%04x FS=%04x GS=%04x\n[SP]",
            r->eax, r->ebx, r->ecx, r->edx, r->esi, r->edi, r->ebp, r->esp,
            r->eip, r->eflags,
            r->cs, r->ds, r->es, r->ss, r->fs, r->gs);
    for (p16 = (uint16_t *) seg_to_linear(r->ss, r->esp), i = 0; i < 15; i++)
    	fprintf(stderr," %04x", *p16++);
    fprintf(stderr,"\n[IP]");
    for (p8 = seg_to_linear(r->cs, r->eip), i = 0; i < 25; i++)
    	fprintf(stderr," %02x", *p8++);
    fprintf(stderr,"\n");
}

static int argflags;
#define DEBUG 1

#define DOS_FD_MAX 256
typedef struct {
    int fd; /* -1 means closed */
} DOSFile;

DOSFile dos_files[DOS_FD_MAX];
uint16_t cur_psp;
uint16_t cur_dta_seg;
uint16_t cur_dta_ofs;

void dos_init(void)
{
    int i;
    for(i = 0; i < DOS_FD_MAX; i++)
        dos_files[i].fd = (i < 3) ? i : -1;
}

static inline void set_error(struct vm86_regs *r, int val)
{
    r->eflags &= ~CF_MASK;
    if (val) {
        r->eax = (r->eax & ~0xffff) | val;
        r->eflags |= CF_MASK;
    }
}
static DOSFile *get_file(int h)
{
    DOSFile *fh;

    if (h < DOS_FD_MAX) {
        fh = &dos_files[h];
        if (fh->fd != -1)
            return fh;
    }
    return NULL;
}

/* return -1 if error */
static int get_new_handle(void)
{
    DOSFile *fh;
    int i;

    for(i = 0; i < DOS_FD_MAX; i++) {
        fh = &dos_files[i];
        if (fh->fd == -1)
            return i;
    }
    return -1;
}

static char *get_filename1(struct vm86_regs *r, char *buf, int buf_size,
                           uint16_t seg, uint16_t offset)
{
    char *q;
    int c;
    q = buf;
    for(;;) {
        c = *seg_to_linear(seg, offset);
        if (c == 0)
            break;
        if (q >= buf + buf_size - 1)
            break;
        c = tolower(c);
        if (c == '\\')
            c = '/';
        *q++ = c;
        offset++;
    }
    *q = '\0';
    if (buf[1] == ':')
    	strcpy(buf, buf+2);
    return buf;
} 

static char *get_filename(struct vm86_regs *r, char *buf, int buf_size)
{
    return get_filename1(r, buf, buf_size, r->ds, r->edx & 0xffff);
}

static char *upcase(const char *s)
{
    static char buffer[80];
    int i;
    for (i = 0; i < sizeof(buffer)-1; i++, s++)
	buffer[i] = (*s >= 'a' && *s <= 'z') ? *s + 'A' - 'a' : *s;
    return buffer;
}

typedef struct __attribute__((packed)) {
    uint8_t drive_num;
    uint8_t file_name[8];
    uint8_t file_ext[3];
    uint16_t current_block;
    uint16_t logical_record_size;
    uint32_t file_size;
    uint16_t date;
    uint16_t time;
    uint8_t reserved[8];
    uint8_t record_in_block;
    uint32_t record_num;
} FCB;

typedef struct __attribute__((packed)) {
    uint16_t environ;
    uint16_t cmdtail_off;
    uint16_t cmdtail_seg;
    uint32_t fcb1;
    uint32_t fcb2;
    uint16_t sp, ss;
    uint16_t ip, cs;
} ExecParamBlock;

typedef struct __attribute__((packed)) {
    /* internals */
	uint8_t attr;		/* 00 */
	uint8_t drive_letter;	/* 01 */
	uint8_t template[11];	/* 02 */
	uint16_t entry_count;	/* 0D */
	uint32_t dta_address;	/* 0F */
	uint16_t cluster_parent_dir;	/* 13 */
    /* output */
	uint8_t attr_found;	/* 15 */
	uint16_t file_time;	/* 16 */
	uint16_t file_date;	/* 18 */
	uint32_t file_size;	/* 1A */
	uint8_t filename[13];	/* 1E */
} dirdta;

typedef struct MemBlock {
    struct MemBlock *next;
    uint16_t seg;
    uint16_t size; /* in paragraphs */
} MemBlock;

/* first allocated paragraph */
MemBlock *first_mem_block = NULL;

#define MEM_START 0x1000
#define MEM_END   0xa000

/* return -1 if error */
int mem_malloc(int size, int *pmax_size)
{
    MemBlock *m, **pm;
    int seg_free, seg;
    
    /* XXX: this is totally inefficient, but we have only 1 or 2
       blocks ! */
    seg_free = MEM_START;
    for(pm = &first_mem_block; *pm != NULL; pm = &(*pm)->next) {
        m = *pm;
        seg = m->seg + m->size;
        if (seg > seg_free)
            seg_free = seg;
    }
    if ((seg_free + size) > MEM_END)
        return -1;
    if (pmax_size)
        *pmax_size = MEM_END - seg_free;
    /* add at the end */
    m = malloc(sizeof(MemBlock));
    *pm = m;
    m->next = NULL;
    m->seg = seg_free;
    m->size = size;
#ifdef DUMP_INT21
    printf("mem_malloc size=0x%04x: 0x%04x\n", size, seg_free);
#endif
    return seg_free;
}

/* return -1 if error */
int mem_free(int seg)
{
    MemBlock *m, **pm;
    for(pm = &first_mem_block; *pm != NULL; pm = &(*pm)->next) {
        m = *pm;
        if (m->seg == seg) {
            *pm = m->next;
            free(m);
            return 0;
        }
    }
    return -1;
}

/* return -1 if error or the maxmium size */
int mem_resize(int seg, int new_size)
{
    MemBlock *m, **pm, *m1;
    int max_size;

    for(pm = &first_mem_block; *pm != NULL; pm = &(*pm)->next) {
        m = *pm;
        if (m->seg == seg) {
            m1 = m->next;
            if (!m1)
                max_size = MEM_END - m->seg;
            else
                max_size = m1->seg - m->seg;
            if (new_size > max_size)
                return -1;
            m->size = new_size;
            return max_size;
        }
    }
    return -1;
}

int load_boot(const char *filename, struct vm86_regs *r)
{
    int fd, ret;

    /* load the boot sector */
    fd = open(filename, O_RDONLY);
    if (fd >= 0) {
    	*seg_to_linear(0x0, 0x7dff) = 0;
        r->eax = 0x200;
        r->ebx = r->esp = r->eip = 0x7c00;
        r->ecx = 1;
        r->esi = r->edi = r->ebp =
        r->edx = 0; /* floppy disk */
        r->cs = r->ss = r->ds = r->es = 0;
        r->eflags = VIF_MASK;
        ret = read(fd, seg_to_linear(0x0, 0x7c00), 0x200);
        if (lseek(fd, 0, SEEK_END) > 4*1024*1024)
            r->edx = 0x80; /* hard disk */
        close(fd);
        if (ret != 0x200 ||
            *seg_to_linear(0x0, 0x7dfe) != 0x55 ||
            *seg_to_linear(0x0, 0x7dff) != 0xaa) {
            fprintf(stderr,"No boot sector.\n");
            fd = -1;
        }
    }
    return fd;
}

/* return the PSP or -1 if error */
int load_exe(ExecParamBlock *blk, const char *filename,
             int psp, uint32_t *pfile_size)
{
    int fd, size, base;
    struct {
    	uint16_t signature;		// 0x5A4D 'MZ'
    	uint16_t bytes_in_last_block;
    	uint16_t blocks_in_file;	
    	uint16_t num_relocs;	
    	uint16_t header_paragraphs;	// Size of header
    	uint16_t min_extra_paragraphs;	// BSS size
    	uint16_t max_extra_paragraphs;
    	uint16_t ss;			// Initial (relative) SS value
    	uint16_t sp;			// Initial SP value
    	uint16_t checksum;
    	uint16_t ip;			// Initial IP value
    	uint16_t cs;			// Initial (relative) CS value
    	uint16_t reloc_table_offset;
    	uint16_t overlay_number;
    } header;
    struct {
    	uint16_t offset;
    	uint16_t segment;
    } rel;

    /* load the MSDOS .exe executable */
    fd = open(filename, O_RDONLY);
    if (fd < 0) {
        return -1;
    }
    if (read(fd, &header, sizeof(header)) != sizeof(header)) {
        close(fd);
        return -1;
    }
    
    memset(seg_to_linear(psp, 0x100), 0, 65536 - 0x100);
  
    size = (header.blocks_in_file * 512) - (header.header_paragraphs * 16) + 
